{
    "https://www.allrecipes.com/recipe/217996/summer-squash-and-onion-cheesy-casserole/": {
        "title": "Summer Squash and Onion Cheesy Casserole",
        "rating": "4.1",
        "total_time": "1 hr",
        "servings": "8",
        "resume": "My Great Great Grandmother used to make this when I was young, and it has always been a favorite of my Atlanta and Alabama relatives! I learned how to make it from my Aunt Edith Russell, while visiting her in Atlanta in the mid-1990s!",
        "ingredients": [
            "1 ½ tablespoons butter, divided",
            "3  summer squash, trimmed and cut into bite-size pieces",
            "3  zucchini, trimmed and cut into bite-size pieces",
            "salt and ground black pepper to taste",
            "3  onions, chopped",
            "1 pound shredded sharp white Cheddar cheese",
            "½ pound shredded Cheddar cheese",
            "3 tablespoons sweetened condensed milk, divided"
        ],
        "steps": [
            "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x9-inch baking dish with about 1/2 tablespoon of butter.",
            "Melt remaining 1 tablespoon of butter in a large cast-iron skillet over medium heat, and cook the summer squash and zucchini until the squash pieces begin to brown, 10 to 15 minutes, stirring often. Sprinkle with salt and black pepper, and spread into the bottom of the prepared baking dish. Sprinkle with about 1/3 of the chopped onions.",
            "Mix together the white Cheddar cheese and yellow Cheddar cheese in a bowl until thoroughly combined, and sprinkle about 1/2 cup of the cheese mixture over the onions. Drizzle with about 1 tablespoon of the sweetened condensed milk. Repeat sprinkling cheese, onions, and condensed milk twice more, then top with remaining cheese mixture.",
            "Bake in the preheated oven until the casserole is golden brown and the onions are tender, about 30 minutes."
        ],
        "nutrition_facts": {
            "Calories": "438",
            "Fat": "31g",
            "Carbs": "17g",
            "Protein": "24g"
        }
    },
    "https://www.allrecipes.com/recipe/86804/zucchini-and-tomato-casserole/": {
        "title": "Zucchini and Tomato Casserole",
        "rating": "4.2",
        "total_time": "55 mins",
        "servings": "8",
        "resume": "A light, yummer summer dish with zucchini, tomato, and Romano cheese. Depending on your tastes and dietary restrictions, you can play with this recipe a lot. One of my favorite ways is to sprinkle cheese on the zucchini before adding the tomatoes.",
        "ingredients": [
            "4  zucchini, cubed",
            "3 tablespoons chopped fresh dill weed",
            "ground black pepper to taste",
            "1 tablespoon margarine, melted",
            "2 large tomatoes, sliced",
            "1 tablespoon chopped fresh basil leaves",
            "¾ cup grated Romano cheese"
        ],
        "steps": [
            "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a 2-quart casserole dish.",
            "Place zucchini in a pot fitted with a steamer basket over boiling water. Steam 5 minutes, or until tender but firm. Transfer to the casserole dish. Mix the dill, pepper, and margarine, and stir into the casserole dish, evenly coating zucchini. Layer tomato slices over zucchini, and sprinkle with basil and Romano cheese.",
            "Bake 30 minutes in the preheated oven, until bubbly and golden brown."
        ],
        "nutrition_facts": {
            "Calories": "80",
            "Fat": "5g",
            "Carbs": "6g",
            "Protein": "5g"
        }
    },
    "https://www.allrecipes.com/recipe/254385/summer-squash-gratin/": {
        "title": "Summer Squash Gratin",
        "rating": "4.7",
        "total_time": "1 hr 2 mins",
        "servings": "6",
        "resume": "I tried this when summer squash was in season, and it came out beautifully. Simple and delicious!",
        "ingredients": [
            "6  buttery crackers",
            "1 tablespoon cornmeal",
            "2 tablespoons olive oil",
            "1  shallot, thinly sliced",
            "2  yellow squash, sliced 1/4-inch thick",
            "2  zucchini, sliced 1/4-inch thick",
            "½ teaspoon garlic powder",
            "1 pinch salt and ground black pepper to taste",
            "½ cup 2% milk",
            "2 tablespoons butter",
            "½ cup shredded Mexican cheese blend"
        ],
        "steps": [
            "Preheat oven to 425 degrees F (220 degrees C).",
            "Place buttery crackers and cornmeal in a plastic resealable bag; seal and pound into fine crumbs.",
            "Heat olive oil in a large skillet over medium heat. Add shallot; cook and stir until translucent, about 5 minutes. Add yellow squash and zucchini. Season with garlic powder, salt, and pepper. Cook until softened, about 10 minutes.",
            "Stir milk and butter into the skillet. Increase heat to medium-high; cook until butter is melted, 2 to 3 minutes. Stir in crumb mixture and Mexican cheese blend. Remove from heat.",
            "Spread yellow squash mixture evenly in an 8-inch square baking pan.",
            "Bake in the preheated oven until bubbly, about 15 minutes. Increase heat to 450 degrees F (230 degrees C) and continue baking until lightly browned, about 10 minutes."
        ],
        "nutrition_facts": {
            "Calories": "176",
            "Fat": "14g",
            "Carbs": "10g",
            "Protein": "5g"
        }
    },
    "https://www.allrecipes.com/recipe/254386/cheesy-zucchini-gratin/": {
        "title": "Cheesy Zucchini Gratin",
        "rating": "4.5",
        "total_time": "1 hr 5 mins",
        "servings": "6",
        "resume": "This was my first attempt at a gratin and I think it turned out nicely! It's a healthy, cheesy vegetable casserole.",
        "ingredients": [
            "1 cup grated Gruyere cheese",
            "1 cup panko bread crumbs",
            "¼ cup butter",
            "2  zucchini, sliced",
            "1  yellow squash, sliced",
            "2  shallots, diced",
            "1 clove garlic, minced (Optional)",
            "2 tablespoons chopped fresh basil",
            "1 tablespoon chopped fresh rosemary",
            "salt and ground black pepper to taste",
            "1 ½ tablespoons all-purpose flour",
            "¾ cup light cream"
        ],
        "steps": [
            "Preheat oven to 400 degrees F (200 degrees C).",
            "Mix Gruyere cheese and panko bread crumbs together in a bowl.",
            "Heat butter in a large skillet over medium heat until melted. Add zucchini, yellow squash, shallots, and garlic; cook and stir until softened, about 10 minutes. Stir in basil, rosemary, salt, and black pepper; cook until fragrant, about 1 minute.",
            "Mix flour into the skillet. Pour in cream in a steady stream and stir until thickened, 3 to 5 minutes. Mix in half the cheese mixture. Remove from heat.",
            "Pour zucchini mixture into a baking dish. Top with remaining cheese mixture.",
            "Bake in the preheated oven until bubbly and golden brown, about 20 minutes."
        ],
        "nutrition_facts": {
            "Calories": "359",
            "Fat": "26g",
            "Carbs": "23g",
            "Protein": "15g"
        }
    },
    "https://www.allrecipes.com/recipe/222870/moms-zucchini-pancakes/": {
        "title": "Mom's Zucchini Pancakes",
        "rating": "4.9",
        "total_time": "30 mins",
        "servings": "5",
        "resume": "These zucchini pancakes go fast! I am \"Mom\" and have been making these for years. My whole family just loves them. Serve with a dollop of sour cream.",
        "ingredients": [
            "2 cups grated zucchini",
            "2 large eggs, slightly beaten",
            "2 tablespoons chopped green onion",
            "1/2 cup all-purpose flour",
            "1/4 cup grated Parmesan cheese",
            "1/2 teaspoon baking powder",
            "1/2 teaspoon salt",
            "1 pinch dried oregano",
            "1/4 cup vegetable oil, or as needed",
            "sour cream for serving (Optional)"
        ],
        "steps": [
            "Gather the ingredients. Photographer : Will Dickey / Food Styling: Emily Nabors Hall / Prop Styling: Josh Hoggle",
            "Blot grated zucchini with paper towels to remove moisture. Photographer : Will Dickey / Food Styling: Emily Nabors Hall / Prop Styling: Josh Hoggle",
            "Stir zucchini, eggs, and green onion together in a large bowl. Mix flour, Parmesan cheese, baking powder, salt, and oregano together in a separate bowl; stir into zucchini mixture until batter is just moistened. Photographer : Will Dickey / Food Styling: Emily Nabors Hall / Prop Styling: Josh Hoggle",
            "Heat oil in a large skillet over medium-high heat. Drop rounded spoonfuls of zucchini batter into hot oil; pan-fry until golden, 2 to 3 minutes per side. Photographer : Will Dickey / Food Styling: Emily Nabors Hall / Prop Styling: Josh Hoggle",
            "Drain zucchini pancakes on a paper towel-lined plate; serve warm. Photographer : Will Dickey / Food Styling: Emily Nabors Hall / Prop Styling: Josh Hoggle"
        ],
        "nutrition_facts": {
            "Calories": "205",
            "Fat": "15g",
            "Carbs": "13g",
            "Protein": "6g"
        }
    },
    "https://www.allrecipes.com/recipe/200919/grilled-garlic-parmesan-zucchini/": {
        "title": "Grilled Zucchini with Parmesan",
        "rating": "4.7",
        "total_time": "20 mins",
        "servings": "4",
        "resume": "This grilled zucchini side dish with garlic butter and melted Parmesan is a summer favorite at my house. So easy and tasty, and complements grilled steak, ribs, chicken, or fish.",
        "ingredients": [
            "3  zucchini",
            "3 tablespoons butter, softened",
            "2 cloves garlic, minced",
            "1 tablespoon chopped fresh parsley",
            "½ cup freshly grated Parmesan cheese"
        ],
        "steps": [
            "Preheat an outdoor grill for medium-high heat, and lightly oil the grate.",
            "Cut the zucchini in half crosswise, then slice each half into 3 slices lengthwise, making 6 slices per zucchini.",
            "Mix the butter, garlic, and parsley in a bowl, and spread the mixture on both sides of each zucchini slice. Sprinkle one side of each slice with Parmesan cheese, and place the slices, cheese sides up, crosswise on the preheated grill to keep them from falling through.",
            "Grill the zucchini until the cheese has melted and the slices are cooked through and show grill marks, about 8 minutes."
        ],
        "nutrition_facts": {
            "Calories": "146",
            "Fat": "12g",
            "Carbs": "6g",
            "Protein": "6g"
        }
    },
    "https://www.allrecipes.com/recipe/274408/zucchini-squash-and-corn-casserole/": {
        "title": "Zucchini, Squash, and Corn Casserole",
        "rating": null,
        "total_time": "1 hr 20 mins",
        "servings": "16",
        "resume": "Delish way to use summer veggies. My kids love this.",
        "ingredients": [
            "1 pound yellow squash, cut into 1/4-inch slices",
            "1 pound zucchini, cut into 1/4-inch slices",
            "4 tablespoons butter, divided",
            "2 cups diced sweet onion",
            "2 cloves garlic, minced",
            "1 (15.25 ounce) can whole kernel corn, drained",
            "1 (15 ounce) can cream-style corn",
            "1 ½ cups shredded sharp white Cheddar cheese",
            "1 cup grated Asiago cheese, divided",
            "1 ½ cups bread crumbs, divided",
            "½ cup mayonnaise",
            "2 large eggs, beaten",
            "1 teaspoon salt",
            "1 teaspoon ground black pepper"
        ],
        "steps": [
            "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9x13-inch casserole dish.",
            "Combine zucchini and squash in a large pan, add water to cover, and boil for 5 minutes over medium-high heat. Drain and gently press zucchini and squash between paper towels to remove excess water.",
            "Meanwhile, melt 2 tablespoons butter in a skillet. Add onion and saute for 2 minutes. Add garlic and cook until onion has softened and garlic is fragrant, 2 more minutes. Mix in zucchini and squash. Add whole kernel corn, cream-style corn, Cheddar cheese, 1/2 cup Asiago cheese, 1/2 cup breadcrumbs, mayonnaise, eggs, salt, and pepper. Pour into the prepared casserole dish.",
            "Melt remaining 2 tablespoons butter in a skillet. Add remaining 1 cup breadcrumbs and remaining 1/2 cup Asiago cheese. Mix well and sprinkle on top of the casserole.",
            "Bake in the preheated oven until casserole is golden and set and cheese is melted, 45 to 50 minutes."
        ],
        "nutrition_facts": {
            "Calories": "253",
            "Fat": "16g",
            "Carbs": "22g",
            "Protein": "9g"
        }
    },
    "https://www.allrecipes.com/recipe/21342/calico-squash-casserole/": {
        "title": "Calico Squash Casserole",
        "rating": "4.5",
        "total_time": "50 mins",
        "servings": "8",
        "resume": "My great-aunt made this for a family gathering and it's been a hit ever since, even with the kids! The water chestnuts add a different texture and my husband has even used whole baby carrots instead of shredded carrot. Easy and fast to make and a good way to use up all that squash from the garden!",
        "ingredients": [
            "2 cups sliced yellow squash",
            "1 cup sliced zucchini",
            "1  onion, chopped",
            "¼ cup sliced green onion",
            "1 cup water",
            "1 teaspoon salt, divided",
            "2 cups crushed buttery round crackers",
            "½ cup melted butter",
            "1 (10.75 ounce) can  condensed cream of mushroom soup",
            "1 (8 ounce) can sliced water chestnuts, drained",
            "1 large carrot, shredded",
            "½ cup mayonnaise",
            "½ (4 ounce) jar diced pimento peppers, drained",
            "1 teaspoon sage",
            "½ teaspoon white pepper",
            "1 cup shredded sharp Cheddar cheese"
        ],
        "steps": [
            "Preheat oven to 350 degrees F (175 degrees C).",
            "In a large saucepan combine yellow squash, zucchini, onion, green onion, water and 1/2 teaspoon salt. Cover and cook over medium heat about 6 minutes. Drain well and set aside.",
            "In a medium bowl combine cracker crumbs and butter. Mix well and spread half of the mixture into the bottom of a 9x13 inch casserole dish.",
            "In a large bowl combine soup, water chestnuts, carrots, mayonnaise, pimentos, sage, pepper and remaining 1/2 teaspoon salt. Fold in squash mixture and spoon over crumb crust. Sprinkle cheese on top, and then the remaining cracker crumbs.",
            "Bake in preheated oven for 20 to 30 minutes, or until firm and heated through."
        ],
        "nutrition_facts": {
            "Calories": "401",
            "Fat": "34g",
            "Carbs": "20g",
            "Protein": "6g"
        }
    },
    "https://www.allrecipes.com/recipe/176303/baked-zucchini-de-provence/": {
        "title": "Baked Zucchini de Provence",
        "rating": "4.3",
        "total_time": "55 mins",
        "servings": "4",
        "resume": "This wonderful seasonal side dish has a rich meaty flavor even though it's completely vegetarian!",
        "ingredients": [
            "3  zucchini, sliced into 1/4-inch rounds",
            "3 tablespoons extra-virgin olive oil",
            "2 teaspoons fine sea salt",
            "1 tablespoon herbes de Provence",
            "¼ cup breadcrumbs",
            "¼ cup shredded Parmesan cheese",
            "3 tablespoons extra-virgin olive oil",
            "salt and pepper to taste"
        ],
        "steps": [
            "Preheat an oven to 350 degrees F (175 degrees C).",
            "Arrange a layer of zucchini slices into the bottom of a 9-inch pie pan so they slightly overlap one another; drizzle with 1 tablespoon olive oil and season with some of the sea salt and herbes de Provence. Repeat layering until the zucchini is all used.",
            "Bake in the preheated oven for 30 minutes.",
            "While the zucchini bakes, stir together the breadcrumbs, Parmesan cheese, and 3 tablespoons olive oil in a bowl; season with salt and pepper. Spread evenly over the baked zucchini and return to oven 10 minutes more; serve hot."
        ],
        "nutrition_facts": {
            "Calories": "250",
            "Fat": "23g",
            "Carbs": "8g",
            "Protein": "4g"
        }
    },
    "https://www.allrecipes.com/recipe/74077/zucchini-herb-casserole/": {
        "title": "Zucchini Herb Casserole",
        "rating": "4.4",
        "total_time": "55 mins",
        "servings": "6",
        "resume": "I've been making this casserole for almost 20 years and it's always a hit. Even my meat-eater husband likes it. Serve with a crusty French bread or soft breadsticks. Leftovers are great in an omelet the next day.",
        "ingredients": [
            "⅓ cup uncooked long grain white rice",
            "⅔ cup water",
            "2 tablespoons vegetable oil",
            "1 ½ pounds zucchini, cubed",
            "1 cup sliced green onions",
            "1 clove garlic, minced",
            "1 ¼ teaspoons garlic salt",
            "½ teaspoon basil",
            "½ teaspoon sweet paprika",
            "½ teaspoon dried oregano",
            "1 ½ cups seeded, chopped tomatoes",
            "2 cups shredded sharp Cheddar cheese, divided"
        ],
        "steps": [
            "Combine the rice and water in a saucepan, and bring to a boil. Reduce heat to low, cover, and simmer 20 minutes, until rice is tender.",
            "Preheat oven to 350 degrees F (175 degrees C). Lightly grease a shallow 1 1/2 quart casserole dish.",
            "Heat the oil in a skillet over medium heat, and cook the zucchini, green onions, and garlic 5 minutes, or until tender. Season with garlic salt, basil, paprika, and oregano. Mix in the cooked rice, tomatoes, and 1 cup cheese. Continue to cook and stir until heated through. Transfer to the prepared casserole dish. Top with remaining cheese.",
            "Bake uncovered 20 minutes, or until cheese is melted and bubbly."
        ],
        "nutrition_facts": {
            "Calories": "266",
            "Fat": "18g",
            "Carbs": "17g",
            "Protein": "12g"
        }
    },
    "https://www.allrecipes.com/recipe/270058/zucchini-feta-casserole/": {
        "title": "Zucchini-Feta Casserole",
        "rating": null,
        "total_time": "1 hr 25 mins",
        "servings": "8",
        "resume": "My local gourmet grocery store use to sell single servings of this, but they quit selling it. I was addicted to it, so one of the employees emailed me the recipe so I could do it myself. A great vegetarian dish or side dish.",
        "ingredients": [
            "¾ cup bulgur",
            "¾ cup boiling water",
            "2 ½ tablespoons vegetable oil",
            "2 cups sliced onions",
            "4 cloves garlic, minced",
            "6 cups thickly sliced zucchini",
            "½ teaspoon dried oregano",
            "½ teaspoon dried basil",
            "½ teaspoon dried marjoram",
            "⅛ teaspoon ground black pepper",
            "2  eggs",
            "1 cup grated feta cheese",
            "1 cup cottage cheese",
            "½ cup chopped fresh parsley",
            "2 tablespoons tomato paste",
            "1 tablespoon tamari",
            "1 cup grated Cheddar cheese",
            "2 medium tomatoes, thinly sliced",
            "1 ½ tablespoons sesame seeds (Optional)"
        ],
        "steps": [
            "Place bulgur in a bowl and cover with boiling water. Cover and set aside until water is absorbed.",
            "Preheat the oven to 350 degrees F (175 degrees C). Grease a 9-inch square casserole dish.",
            "Meanwhile, heat oil in a large skillet over medium heat. Add onions and garlic and cook until just translucent, 3 to 5 minutes. Add zucchini, oregano, basil, marjoram, and black pepper. Cook until zucchini is tender but not falling apart, about 5 minutes more.",
            "Beat eggs lightly in a bowl. Add feta cheese and cottage cheese.",
            "Add parsley, tomato paste, and tamari to the bowl with the bulgur and mix well.",
            "Layer bulgur mixture, zucchini mixture, cheese mixture, Cheddar cheese, and tomato into the prepared casserole dish. Sprinkle sesame seeds on top. Cover with aluminum foil.",
            "Bake in the preheated oven until bubbly, about 45 minutes."
        ],
        "nutrition_facts": {
            "Calories": "285",
            "Fat": "17g",
            "Carbs": "21g",
            "Protein": "15g"
        }
    },
    "https://www.allrecipes.com/recipe/16503/zucchini-delight/": {
        "title": "Zucchini Delight",
        "rating": "3.7",
        "total_time": "30 mins",
        "servings": "3",
        "resume": "This is a quick and healthy dish. Great in the summer when zucchini is in season! Sound too easy to be good? Try it!",
        "ingredients": [
            "3  zucchini, sliced",
            "1  onion, chopped",
            "1 (14.5 ounce) can canned peeled and diced tomatoes",
            "½ cup shredded Cheddar cheese",
            "salt and pepper to taste"
        ],
        "steps": [
            "Preheat oven to 350 degrees F (175 degrees C).",
            "Slice zucchini and onion and place in a glass dish baking dish. Add can of tomatoes, salt and pepper. Sprinkle cheese over top. Place lid on dish.",
            "Bake in the preheated 350 degrees F (175 degrees C) until zucchini becomes tender, 20 minutes."
        ],
        "nutrition_facts": {
            "Calories": "150",
            "Fat": "7g",
            "Carbs": "15g",
            "Protein": "9g"
        }
    },
    "https://www.allrecipes.com/recipe/13853/cheesy-zucchini-dish/": {
        "title": "Cheesy Zucchini Dish",
        "rating": "4.0",
        "total_time": null,
        "servings": "11",
        "resume": "This is a cheesy zucchini dish in which the zucchini are breaded and fried, spread with sour cream, topped with sharp cheddar cheese and baked.",
        "ingredients": [
            "12 small zucchinis",
            "1 ½ cups all-purpose flour",
            "1 tablespoon garlic powder",
            "salt and pepper to taste",
            "1 cup milk",
            "2 teaspoons garlic powder",
            "salt and pepper to taste",
            "16 ounces sour cream",
            "3 cups shredded sharp Cheddar cheese",
            "⅓ cup vegetable oil"
        ],
        "steps": [
            "Preheat oven to 350 degrees F (175 degrees C). Spray one 9x13 inch baking dish with non-stick spray.",
            "Bring a pot of water to a boil; blanch zucchini, drain and cool.",
            "In a shallow bowl, mix together 1 1/2 cups flour, 1 tablespoon garlic powder and salt and pepper to taste. In a separate bowl, combine the milk, 2 teaspoons garlic, salt and pepper to taste.",
            "Cut ends off zucchini and then cut in thirds. Roll zucchini in flour mixture, then in milk and again in flour to cover completely. Set aside on parchment paper until all pieces are covered.",
            "Heat large frying pan over medium high heat, add oil and brown zucchini on all sides. Remove and arrange in a 9x13 inch baking dish. Spread sour cream over zucchini and top with cheese.",
            "Bake for 20 to 25 minutes or until cheese is beginning to brown. Remove from oven and let sit for 10 minutes and serve."
        ],
        "nutrition_facts": {
            "Calories": "397",
            "Fat": "29g",
            "Carbs": "22g",
            "Protein": "15g"
        }
    },
    "https://www.allrecipes.com/recipe/260156/sheet-pan-vegetable-dinner-with-feta/": {
        "title": "Sheet Pan Vegetable Dinner with Feta",
        "rating": "4.8",
        "total_time": "50 mins",
        "servings": "6",
        "resume": "This sheet pan dinner recipe is super versatile - you can use most vegetables for it, depending on your preference. I chop them very coarsely to save time and the cook time can vary. We eat this as dinner with bread and salad but you can also serve it as a side. Leftovers also taste great cold.",
        "ingredients": [
            "¼ cup olive oil",
            "2 small zucchini, sliced",
            "2 small carrots, chopped",
            "2  red bell peppers - cored, seeded, and cut into chunks",
            "2  potatoes, peeled and cut into 1/2-inch cubes",
            "15  cherry tomatoes",
            "15  black olives",
            "4  green onions, chopped",
            "2 cloves garlic, pressed or minced",
            "2 teaspoons dried oregano, or to taste",
            "2 teaspoons dried thyme, or to taste",
            "salt and freshly ground black pepper to taste",
            "2 sprigs rosemary",
            "2  bay leaves",
            "1 (4 ounce) package feta cheese, crumbled"
        ],
        "steps": [
            "Preheat oven to 400 degrees F (200 degrees C). Grease 2 baking sheets with 2 tablespoons olive oil each.",
            "Distribute zucchini, carrots, red bell peppers, potatoes, cherry tomatoes, black olives, and green onions between the 2 baking sheets. Season with garlic, oregano, thyme, salt, and pepper. Place 1 rosemary sprig and 1 bay leaf on each baking sheet.",
            "Bake in the preheated oven until vegetables are lightly browned and easily pierced with a fork, 25 to 35 minutes. Remove from oven, distribute feta evenly between the 2 baking sheets, and return to oven. Bake until feta is slightly melted, 5 to 10 minutes."
        ],
        "nutrition_facts": {
            "Calories": "241",
            "Fat": "15g",
            "Carbs": "23g",
            "Protein": "6g"
        }
    },
    "https://www.allrecipes.com/recipe/89091/zucchini-corn-fritters/": {
        "title": "Zucchini Corn Fritters",
        "rating": "4.6",
        "total_time": "30 mins",
        "servings": "24",
        "resume": "These zucchini corn fritters are full of grated zucchini and fresh corn. Cheese is optional, but not in my house! They're light and fluffy, and my family can't get enough of them. Serve hot with ranch dressing.",
        "ingredients": [
            "2 cups all-purpose flour",
            "½ cup sugar, or to taste",
            "1 tablespoon baking powder",
            "½ teaspoon cumin",
            "½ teaspoon salt",
            "freshly ground black pepper to taste",
            "1 cup milk",
            "¼ cup butter, melted and slightly cooled",
            "2 large eggs, beaten",
            "2 cups grated zucchini",
            "1 ½ cups fresh corn, kernels cut from cob",
            "1 cup finely shredded Cheddar cheese (Optional)",
            "1 quart oil for frying, or as needed"
        ],
        "steps": [
            "Whisk flour, sugar, baking powder, cumin, salt, and pepper together in a large bowl.",
            "Whisk milk, melted butter, and eggs, together in a small bowl; pour into flour mixture and whisk to combine. Stir in zucchini, corn, and Cheddar until well combined.",
            "Heat oil in a deep fryer or large saucepan to 350 degrees F (175 degrees C). Working in batches, drop tablespoonfuls of batter into hot oil. Fry until crisp and brown, about 4 minutes per batch, turning halfway through with tongs. Drain on a paper towel-lined plate."
        ],
        "nutrition_facts": {
            "Calories": "424",
            "Fat": "40g",
            "Carbs": "15g",
            "Protein": "2g"
        }
    },
    "https://www.allrecipes.com/recipe/278329/italian-polenta-casserole/": {
        "title": "Italian Polenta Casserole",
        "rating": "4.0",
        "total_time": "1 hr 15 mins",
        "servings": "6",
        "resume": "Cheesy polenta layered with thinly sliced zucchini and marinara sauce makes a delicious side dish to steak, pork chops, or chicken!",
        "ingredients": [
            "1 (14 ounce) can cherry tomatoes",
            "¼ cup fresh basil",
            "2 cloves garlic",
            "1 tablespoon red wine",
            "⅛ teaspoon salt",
            "3 cups water",
            "½ teaspoon salt",
            "¾ cup polenta",
            "1 cup grated Pecorino Romano cheese",
            "2 tablespoons butter",
            "1 medium zucchini, thinly sliced",
            "1 ½ cups finely shredded Italian-style cheese"
        ],
        "steps": [
            "Preheat the oven to 350 degrees F (175 degrees C). Grease a 1 1/2-quart casserole dish.",
            "Combine cherry tomatoes, basil, garlic, red wine, and 1/8 teaspoon salt for marinara in the bowl of a food processor. Pulse a few times to puree. Set aside.",
            "Bring water and 1/2 teaspoon salt to a boil in a medium saucepan over medium-high heat. Whisk in polenta slowly, whisking constantly to ensure there are no lumps. Bring back to a boil; reduce heat to low and cook, stirring occasionally, for 5 minutes. Remove from heat and stir in Pecorino Romano cheese and butter.",
            "Pour 1/2 of the polenta into the prepared casserole dish. Top with 1/2 of the sliced zucchini, overlapping slices slightly. Top zucchini with 1/2 of the marinara sauce, then sprinkle with 1/2 of the Italian-style cheese. Repeat layers one more time.",
            "Bake, covered, in the preheated oven for 30 minutes. Uncover and continue to bake until cheese on top is slightly brown, about 10 minutes more. Remove from the oven and let stand for 5 minutes before serving."
        ],
        "nutrition_facts": {
            "Calories": "318",
            "Fat": "19g",
            "Carbs": "21g",
            "Protein": "17g"
        }
    }
}